IDEA Open Model
BoltGrid Class
Compatible with IDEA StatiCa Beta 20.0
 Data of the bolt grid
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.BoltGrid
 IdeaRS.OpenModel.Connection.AnchorGrid
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class BoltGrid
Public Class BoltGrid
The BoltGrid type exposes the following members.
Constructors
Name | Description
BoltGrid
Initializes a new instance of the BoltGrid class
Top
Properties
Name | Description
AnchorLen
 Anchor lenght
AxisX
 Bolt grid LCS - Axis X
AxisY
 Bolt grid LCS - Axis Y
AxisZ
 Bolt grid LCS - Axis Z
BoltAssemblyName
 The description of the bolt assembly
BoreHole
 The BoreHole of bold
ConnectedPartIds
 Id of the weld
ConnectedPlates
 Identifiers of the connected plates
DiagonalHeadDiameter
 The Diagonal Head Diameter of bold
Diameter
 The diameter of bold
HeadDiameter
 The head diameter of bold
HeadHeight
 The Head Height of bold
HoleDiameter
 The diameter of the hole
Id
 Unique Id of the bolt grid
IsAnchor
 Is Anchor
Material
 The material of the bolt assembly
NutThickness
 The Nut Thickness of bold
Origin
 Origin of the bolt grid LCS
Positions
 Positions of holes in the local coodinate system of the bolt grid
Standard
 The standard of the bolt assembly
TensileStressArea
 The Tensile Stress Area of bold
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace